import Card from "./components/Card";

const news = [
  {
    title: "Технологийн салбарын шинэ “баатрууд”: PineBaatar",
    desc: "Business.mn, Pinecone Academy-ийн хамтран зохион байгуулсан “Бизнес цэнэг” өглөөний уулзалт өнгөрөгч лхагва гарагт зохион байгуулагдлаа. Тус уулзалтын үеэр технолгийн салбарын мэргэжилтнүүд бүтээмч, бүтээлч сэтгэлгээтэй холбоотой илтгэл тавьснаас гадна Pinecone Academy-ийн цоо шинэ платформ болох Pinebaatar танилцуулагдсан нь онцлог байв. Ингээд технологийн салбарт цахиур хагалах, чадварлаг хүний нөөц бэлтгэх үйлсэд хувь нэмэр оруулж буй Pinecone академийн шинэ платформтой танилцъя. ",
    image:
      "https://unread.today/files/e8e08e0b-2c4f-4f62-83e2-43a512c166d6/980f065d28b43df60a2da376a00b5e44.jpg",
    date: "2024-12-17",
  },
  {
    title: "Технологийн салбарын шинэ “баатрууд”: PineBaatar",
    desc: "Business.mn, Pinecone Academy-ийн хамтран зохион байгуулсан “Бизнес цэнэг” өглөөний уулзалт өнгөрөгч лхагва гарагт зохион байгуулагдлаа. Тус уулзалтын үеэр технолгийн салбарын мэргэжилтнүүд бүтээмч, бүтээлч сэтгэлгээтэй холбоотой илтгэл тавьснаас гадна Pinecone Academy-ийн цоо шинэ платформ болох Pinebaatar танилцуулагдсан нь онцлог байв. Ингээд технологийн салбарт цахиур хагалах, чадварлаг хүний нөөц бэлтгэх үйлсэд хувь нэмэр оруулж буй Pinecone академийн шинэ платформтой танилцъя. ",
    image:
      "https://unread.today/files/e8e08e0b-2c4f-4f62-83e2-43a512c166d6/980f065d28b43df60a2da376a00b5e44.jpg",
    date: "2024-12-18",
  },
  {
    title: "Технологийн салбарын шинэ “баатрууд”: PineBaatar",
    desc: "Business.mn, Pinecone Academy-ийн хамтран зохион байгуулсан “Бизнес цэнэг” өглөөний уулзалт өнгөрөгч лхагва гарагт зохион байгуулагдлаа. Тус уулзалтын үеэр технолгийн салбарын мэргэжилтнүүд бүтээмч, бүтээлч сэтгэлгээтэй холбоотой илтгэл тавьснаас гадна Pinecone Academy-ийн цоо шинэ платформ болох Pinebaatar танилцуулагдсан нь онцлог байв. Ингээд технологийн салбарт цахиур хагалах, чадварлаг хүний нөөц бэлтгэх үйлсэд хувь нэмэр оруулж буй Pinecone академийн шинэ платформтой танилцъя. ",
    image:
      "https://unread.today/files/e8e08e0b-2c4f-4f62-83e2-43a512c166d6/980f065d28b43df60a2da376a00b5e44.jpg",
    date: "2024-12-19",
  },
];

const App = () => {
  return (
    <div className="container">
      {news.map((medee) => {
        return (
          <Card
            date={medee.date}
            title={medee.title}
            desc={medee.desc}
            image={medee.image}
          />
        );
      })}
    </div>
  );
};

export default App;
